# Exercise 3-1: Create some plots

In [1]:
import pandas as pd

data_dir = '../../data'

## Get the data

In [2]:
awards_summary_df = pd.read_pickle(f'{data_dir}/pkl_files/awards_summary_diryr_df.pkl')
awards_summary_df.head()

   awd_year dir_abbr  awd_count  sum_awd_amount
0      2008      CSE          3        463433.0
1      2008      ENG          1        300000.0
2      2008      GEO          1         64257.0
3      2008      MPS          1        113753.0
4      2008      SBE          3        623175.0

In [3]:
# Use pivot() to make a wide format DataFrame
# with years as rows, directorate abbreviations as columns,
# and award counts as values
awards_wide_df = awards_summary_df.pivot(index='awd_year',columns='dir_abbr',values='awd_count')
awards_wide_df.head()

dir_abbr,BFA,BIO,CSE,EDU,ENG,GEO,IRM,MPS,NCO,NNCO,NSB,O/D,OCIO,OPP,SBE,TIP
awd_year,,,,,,,,,,,,,,,,
2008,NaN,NaN,3.0,NaN,1.0,1.0,NaN,1.0,NaN,NaN,NaN,NaN,NaN,NaN,3.0,NaN
2009,NaN,81.0,56.0,29.0,65.0,59.0,2.0,112.0,NaN,NaN,NaN,3.0,NaN,NaN,38.0,1.0
2010,12.0,1535.0,1789.0,1139.0,1777.0,2027.0,12.0,2771.0,NaN,NaN,1.0,497.0,NaN,NaN,1308.0,615.0
2011,5.0,1433.0,1598.0,1023.0,1726.0,1770.0,8.0,2434.0,NaN,NaN,7.0,418.0,NaN,NaN,1048.0,482.0
2012,5.0,1323.0,1810.0,1052.0,1788.0,1732.0,7.0,2653.0,NaN,NaN,10.0,355.0,NaN,NaN,1061.0,510.0

## Visualize the data

In [4]:
# Query the `awards_summary_df` DataFrame to filter rows where the dir_abbr column contains specific 
# directorate abbreviations ("PHY", "CSE", "ENG", "GEO"). Then create a scatter plot with awd_year
# on the x-axis and awd_count on the y-axis.

In [5]:
# Plot the awards_wide_df DataFrame to visualize the data

In [6]:
# Plot a line chart for the 'CSE' column in the awards_wide_df DataFrame
# Title: "Award Count: Computer and Information Science and Engineering"

In [7]:
# Plot an area chart for the awards_wide_df DataFrame

In [8]:
# Plot a bar chart for the year 2024 from the awards_wide_df DataFrame

In [9]:
# Filter the awards_summary_df DataFrame for the year 2024, pivot it to have directorate abbreviations as rows,
# and award counts as values, then plot a bar chart with a title and rotated x-axis labels.

In [10]:
# Plot a histogram of the 'awd_count' column from the awards_summary_df DataFrame with 15 bins

In [11]:
# Filter the awards_summary_df DataFrame for the year 2024 and plot a density plot 
# for the 'awd_count' column with a grid and a title.

In [12]:
# Filter the awards_summary_df DataFrame for specific years (2018-2024),
# group by 'awd_year', sum the 'awd_count' column, and plot a pie chart.

In [13]:
# Plot a horizontal bar chart for the specified years (2018-2024) from the awards_wide_df DataFrame.
# Each directorate abbreviation is plotted as a separate subplot, arranged in a 4x4 layout.